from random import randint, choice

station = [
    "1000-臺北",
    "3300-臺中",
    "1210-新竹",
    "0900-基隆",
    "0930-七堵",
    "0980-南港",
    "0990-松山",
    "1020-板橋",
    # "1040-樹林",
    "1080-桃園",
    "1100-中壢",
    "1250-竹南",
    # "2130-後龍",
    # "2170-通霄",
    # "2180-苑裡",
    # "2200-大甲",
    # "2220-清水",
    # "2230-沙鹿",
    "3160-苗栗",
    "3230-豐原",
    "3360-彰化",
    "3390-員林",
    "3470-斗六",
    "4080-嘉義",
    # "4120-新營",
    "4220-臺南",
    # "4340-新左營",
    "4400-高雄",
    # "4440-鳳山",
    "5000-屏東",
    "5050-潮州",
    # "5120-枋寮",
    "5230-知本",
    "6000-臺東",
    # "6050-關山",
    # "6070-池上",
    # "6110-玉里",
    # "6130-瑞穗",
    "7000-花蓮",
    # "7160-羅東",
    "7190-宜蘭",
]

local_table = {
    "A": 1,
    "B": 0,
    "C": 9,
    "D": 8,
    "E": 7,
    "F": 6,
    "G": 5,
    "H": 4,
    "I": 9,
    "J": 3,
    "K": 2,
    "L": 2,
    "M": 1,
    "N": 0,
    "O": 8,
    "P": 9,
    "Q": 8,
    "R": 7,
    "S": 6,
    "T": 5,
    "U": 4,
    "V": 3,
    "W": 1,
    "X": 3,
    "Y": 2,
    "Z": 0,
}


def generateId():
    local = choice(list(local_table.keys()))
    sex = randint(1, 2)
    total = local_table[local] + sex * 8
    result = f"{local}{sex}"

    for i in range(1, 8):
        num = randint(0, 9)
        total = total + num * (8 - i)
        result = f"{result}{num}"

    num10 = (10 - total % 10) % 10
    result = f"{result}{num10}"
    return result
